# Importar Librerías - Limpieza y Transformación de Datos

In [185]:
import pandas as pd
import numpy as np
#import matplotlib as plt
import matplotlib.pyplot as plt
import re

In [186]:
salaries = pd.read_csv('./dataset2/linkedin-jobs-usa.csv')

In [187]:
salaries.shape

(2845, 9)

In [188]:
salaries.head()

,title,company,description,onsite_remote,salary,location,criteria,posted_date,link
0,Data Analyst - Recent Graduate,PayPal,"At PayPal (NASDAQ: PYPL), we believe that ever...",onsite,NaN,Buffalo-Niagara Falls Area,"[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-22,https://www.linkedin.com/jobs/view/data-analys...
1,Data Analyst - Recent Graduate,PayPal,"At PayPal (NASDAQ: PYPL), we believe that ever...",onsite,NaN,"San Jose, CA","[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-22,https://www.linkedin.com/jobs/view/data-analys...
2,Data Analyst,PayPal,"At PayPal (NASDAQ: PYPL), we believe that ever...",onsite,NaN,"Texas, United States","[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-17,https://www.linkedin.com/jobs/view/data-analys...
3,Data Analyst,PayPal,"At PayPal (NASDAQ: PYPL), we believe that ever...",onsite,NaN,"Illinois, United States","[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-17,https://www.linkedin.com/jobs/view/data-analys...
4,Entry-Level Data Analyst,The Federal Savings Bank,"The Federal Savings Bank, a national bank and ...",onsite,NaN,"Chicago, IL","[{'Seniority level': 'Entry level'}, {'Employm...",2022-11-17,https://www.linkedin.com/jobs/view/entry-level...

In [189]:
salaries.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2845 entries, 0 to 2844
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   title          2845 non-null   object
 1   company        2845 non-null   object
 2   description    2845 non-null   object
 3   onsite_remote  2845 non-null   object
 4   salary         929 non-null    object
 5   location       2845 non-null   object
 6   criteria       2845 non-null   object
 7   posted_date    2845 non-null   object
 8   link           2845 non-null   object
dtypes: object(9)
memory usage: 200.2+ KB

## Tratamiento de duplicados

In [190]:
salaries_limpieza = salaries.copy()

In [191]:
salaries_limpieza.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
2840    False
2841    False
2842    False
2843    False
2844    False
Length: 2845, dtype: bool

In [192]:
salaries_limpieza.duplicated().sum()

np.int64(0)

In [193]:
salaries_limpieza[salaries_limpieza.duplicated()]

Empty DataFrame
Columns: [title, company, description, onsite_remote, salary, location, criteria, posted_date, link]
Index: []

In [194]:
salaries_limpieza = salaries_limpieza.drop_duplicates()

## Tratamiento de Valores Nulos NAN

### Visualizar los valores nulos

In [195]:
salaries_limpieza.isna()

,title,company,description,onsite_remote,salary,location,criteria,posted_date,link
0,False,False,False,False,True,False,False,False,False
1,False,False,False,False,True,False,False,False,False
2,False,False,False,False,True,False,False,False,False
3,False,False,False,False,True,False,False,False,False
4,False,False,False,False,True,False,False,False,False
...,...,...,...,...,...,...,...,...,...
2840,False,False,False,False,True,False,False,False,False
2841,False,False,False,False,False,False,False,False,False
2842,False,False,False,False,True,False,False,False,False
2843,False,False,False,False,False,False,False,False,False
2844,False,False,False,False,False,False,False,False,False

In [196]:
print(f'Valores NaN por columna: {salaries_limpieza.isna().sum()}')

Valores NaN por columna: title               0
company             0
description         0
onsite_remote       0
salary           1916
location            0
criteria            0
posted_date         0
link                0
dtype: int64

In [197]:
df_sin_nulos = salaries_limpieza.dropna()

In [198]:
df_sin_nulos.shape

(929, 9)

In [199]:
#df_sin_nulos = salaries_limpieza.dropna(axis=1) Elimina NaNs y la columna

df_sin_nulos = salaries_limpieza.dropna(axis=0, how='any') #Elimina NaNs por fila

#how='any' Elimina si por lo menos hay un NaN
#how='all' Elimina si todos son NaN
#salaries.dropnan(axis=0, how='any')
#salaries.dropnan(axis=0, how='all')
#salaries.dropnan(axis=1, how='any')
#salaries.dropnan(axis=1, how='all')

In [200]:
df_sin_nulos.isna().sum()

title            0
company          0
description      0
onsite_remote    0
salary           0
location         0
criteria         0
posted_date      0
link             0
dtype: int64

In [201]:
df_sin_nulos.head()

,title,company,description,onsite_remote,salary,location,criteria,posted_date,link
8,Data Analyst,London Approach,The ideal candidate for the Data Analyst/Finan...,onsite,"$100,000.00\r\n -\r\n $1...","Franklin, TN","[{'Seniority level': 'Associate'}, {'Employmen...",2022-11-21,https://www.linkedin.com/jobs/view/data-analys...
24,Data Analyst,"Eva Garland Consulting, LLC","Reporting to the Director of Operations, the D...",onsite,"$50,000.00\r\n -\r\n $55...","Raleigh, NC","[{'Seniority level': 'Entry level'}, {'Employm...",2022-11-22,https://www.linkedin.com/jobs/view/data-analys...
35,Data Analyst,London Approach,The ideal candidate for the Data Analyst/Finan...,onsite,"$100,000.00\r\n -\r\n $1...","Franklin, TN","[{'Seniority level': 'Associate'}, {'Employmen...",2022-11-21,https://www.linkedin.com/jobs/view/data-analys...
61,Data Analyst,London Approach,The ideal candidate for the Data Analyst/Finan...,onsite,"$100,000.00\r\n -\r\n $1...","Franklin, TN","[{'Seniority level': 'Associate'}, {'Employmen...",2022-11-21,https://www.linkedin.com/jobs/view/data-analys...
88,Data Analyst,London Approach,The ideal candidate for the Data Analyst/Finan...,onsite,"$100,000.00\r\n -\r\n $1...","Franklin, TN","[{'Seniority level': 'Associate'}, {'Employmen...",2022-11-21,https://www.linkedin.com/jobs/view/data-analys...

In [202]:
df_sin_nulos['salary'].head()

8     $100,000.00\r\n            -\r\n            $1...
24    $50,000.00\r\n            -\r\n            $55...
35    $100,000.00\r\n            -\r\n            $1...
61    $100,000.00\r\n            -\r\n            $1...
88    $100,000.00\r\n            -\r\n            $1...
Name: salary, dtype: object

In [203]:
df_sin_nulos.shape

(929, 9)

### Parsing de la columna Salary

In [204]:
df_sin_nulos['salary']

8       $100,000.00\r\n            -\r\n            $1...
24      $50,000.00\r\n            -\r\n            $55...
35      $100,000.00\r\n            -\r\n            $1...
61      $100,000.00\r\n            -\r\n            $1...
88      $100,000.00\r\n            -\r\n            $1...
                              ...
2834        $30.00\r\n            -\r\n            $33.00
2836    $120,000.00\r\n            -\r\n            $1...
2841    $75,000.00\r\n            -\r\n            $95...
2843    $85,000.00\r\n            -\r\n            $95...
2844    $130,000.00\r\n            -\r\n            $1...
Name: salary, Length: 929, dtype: object

In [215]:
## Este código toma una columna `'salary'` que contiene valores de salario en formato de cadena, 
## Elimina cualquier caracter no numérico, extrae los dígitos y convierte la columna resultante en valores numéricos de tipo float. 
## El resultado se almacena en una nueva columna llamada `'salary_numeric'`. 
## Esto es útil cuando la columna `'salary'` inicial contiene caracteres no numéricos y se desea trabajar con los salarios como valores numéricos.

df_sin_nulos.loc[:,'salary_numeric'] = df_sin_nulos['salary'].astype(str).apply(lambda x: float(re.search(r'\d+(?:\.\d+)?', x).group()) if re.search(r'\d+(?:\.\d+)?', x) else None)

In [216]:
df_sin_nulos.info()

<class 'pandas.core.frame.DataFrame'>
Index: 930 entries, 8 to salary_numeric
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           929 non-null    object
 1   company         929 non-null    object
 2   description     929 non-null    object
 3   onsite_remote   929 non-null    object
 4   salary          929 non-null    object
 5   location        929 non-null    object
 6   criteria        929 non-null    object
 7   posted_date     929 non-null    object
 8   link            929 non-null    object
 9   salary_numeric  929 non-null    float64
dtypes: float64(1), object(9)
memory usage: 112.2+ KB